/* automatically generated by rust-bindgen */

pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type mystatus_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mycore_string {
    pub data: *mut ::std::os::raw::c_char,
    pub size: usize,
    pub length: usize,
    pub mchar: *mut mchar_async_t,
    pub node_idx: usize,
}
#[test]
fn bindgen_test_layout_mycore_string() {
    assert_eq!(::std::mem::size_of::<mycore_string>() , 40usize , concat ! (
               "Size of: " , stringify ! ( mycore_string ) ));
    assert_eq! (::std::mem::align_of::<mycore_string>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( mycore_string ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_string ) ) . data as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_string ) , "::"
                , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_string ) ) . size as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_string ) , "::"
                , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_string ) ) . length as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_string ) , "::"
                , stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_string ) ) . mchar as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_string ) , "::"
                , stringify ! ( mchar ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_string ) ) . node_idx as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_string ) , "::"
                , stringify ! ( node_idx ) ));
}
impl Clone for mycore_string {
    fn clone(&self) -> Self { *self }
}
pub type mycore_string_t = mycore_string;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mycore_incoming_buffer {
    pub data: *const ::std::os::raw::c_char,
    pub length: usize,
    pub size: usize,
    pub offset: usize,
    pub prev: *mut mycore_incoming_buffer,
    pub next: *mut mycore_incoming_buffer,
}
#[test]
fn bindgen_test_layout_mycore_incoming_buffer() {
    assert_eq!(::std::mem::size_of::<mycore_incoming_buffer>() , 48usize ,
               concat ! ( "Size of: " , stringify ! ( mycore_incoming_buffer )
               ));
    assert_eq! (::std::mem::align_of::<mycore_incoming_buffer>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( mycore_incoming_buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_incoming_buffer ) ) . data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_incoming_buffer
                ) , "::" , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_incoming_buffer ) ) . length as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_incoming_buffer
                ) , "::" , stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_incoming_buffer ) ) . size as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_incoming_buffer
                ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_incoming_buffer ) ) . offset as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_incoming_buffer
                ) , "::" , stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_incoming_buffer ) ) . prev as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_incoming_buffer
                ) , "::" , stringify ! ( prev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mycore_incoming_buffer ) ) . next as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( mycore_incoming_buffer
                ) , "::" , stringify ! ( next ) ));
}
impl Clone for mycore_incoming_buffer {
    fn clone(&self) -> Self { *self }
}
pub type mycore_incoming_buffer_t = mycore_incoming_buffer;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mcsync {
    pub spinlock: *mut ::std::os::raw::c_int,
    pub mutex: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_mcsync() {
    assert_eq!(::std::mem::size_of::<mcsync>() , 16usize , concat ! (
               "Size of: " , stringify ! ( mcsync ) ));
    assert_eq! (::std::mem::align_of::<mcsync>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( mcsync ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mcsync ) ) . spinlock as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mcsync ) , "::" ,
                stringify ! ( spinlock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mcsync ) ) . mutex as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mcsync ) , "::" ,
                stringify ! ( mutex ) ));
}
impl Clone for mcsync {
    fn clone(&self) -> Self { *self }
}
pub type mcsync_t = mcsync;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mchar_async_node {
    pub chunk: *mut mchar_async_chunk_t,
    pub cache: mchar_async_cache_t,
}
#[test]
fn bindgen_test_layout_mchar_async_node() {
    assert_eq!(::std::mem::size_of::<mchar_async_node>() , 72usize , concat !
               ( "Size of: " , stringify ! ( mchar_async_node ) ));
    assert_eq! (::std::mem::align_of::<mchar_async_node>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( mchar_async_node ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_node ) ) . chunk as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_node ) ,
                "::" , stringify ! ( chunk ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_node ) ) . cache as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_node ) ,
                "::" , stringify ! ( cache ) ));
}
impl Clone for mchar_async_node {
    fn clone(&self) -> Self { *self }
}
pub type mchar_async_node_t = mchar_async_node;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mchar_async_cache_node {
    pub value: *mut ::std::os::raw::c_void,
    pub size: usize,
    pub left: usize,
    pub right: usize,
    pub parent: usize,
}
#[test]
fn bindgen_test_layout_mchar_async_cache_node() {
    assert_eq!(::std::mem::size_of::<mchar_async_cache_node>() , 40usize ,
               concat ! ( "Size of: " , stringify ! ( mchar_async_cache_node )
               ));
    assert_eq! (::std::mem::align_of::<mchar_async_cache_node>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( mchar_async_cache_node ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache_node ) ) . value as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache_node
                ) , "::" , stringify ! ( value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache_node ) ) . size as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache_node
                ) , "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache_node ) ) . left as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache_node
                ) , "::" , stringify ! ( left ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache_node ) ) . right as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache_node
                ) , "::" , stringify ! ( right ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache_node ) ) . parent as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache_node
                ) , "::" , stringify ! ( parent ) ));
}
impl Clone for mchar_async_cache_node {
    fn clone(&self) -> Self { *self }
}
pub type mchar_async_cache_node_t = mchar_async_cache_node;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mchar_async_chunk {
    pub begin: *mut ::std::os::raw::c_char,
    pub length: usize,
    pub size: usize,
    pub next: *mut mchar_async_chunk,
    pub prev: *mut mchar_async_chunk,
}
#[test]
fn bindgen_test_layout_mchar_async_chunk() {
    assert_eq!(::std::mem::size_of::<mchar_async_chunk>() , 40usize , concat !
               ( "Size of: " , stringify ! ( mchar_async_chunk ) ));
    assert_eq! (::std::mem::align_of::<mchar_async_chunk>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( mchar_async_chunk ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_chunk ) ) . begin as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_chunk ) ,
                "::" , stringify ! ( begin ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_chunk ) ) . length as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_chunk ) ,
                "::" , stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_chunk ) ) . size as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_chunk ) ,
                "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_chunk ) ) . next as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_chunk ) ,
                "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_chunk ) ) . prev as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_chunk ) ,
                "::" , stringify ! ( prev ) ));
}
impl Clone for mchar_async_chunk {
    fn clone(&self) -> Self { *self }
}
pub type mchar_async_chunk_t = mchar_async_chunk;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mchar_async_cache {
    pub nodes: *mut mchar_async_cache_node_t,
    pub nodes_size: usize,
    pub nodes_length: usize,
    pub nodes_root: usize,
    pub count: usize,
    pub index: *mut usize,
    pub index_length: usize,
    pub index_size: usize,
}
#[test]
fn bindgen_test_layout_mchar_async_cache() {
    assert_eq!(::std::mem::size_of::<mchar_async_cache>() , 64usize , concat !
               ( "Size of: " , stringify ! ( mchar_async_cache ) ));
    assert_eq! (::std::mem::align_of::<mchar_async_cache>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( mchar_async_cache ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache ) ) . nodes as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache ) ,
                "::" , stringify ! ( nodes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache ) ) . nodes_size as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache ) ,
                "::" , stringify ! ( nodes_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache ) ) . nodes_length as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache ) ,
                "::" , stringify ! ( nodes_length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache ) ) . nodes_root as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache ) ,
                "::" , stringify ! ( nodes_root ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache ) ) . count as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache ) ,
                "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache ) ) . index as * const
                _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache ) ,
                "::" , stringify ! ( index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache ) ) . index_length as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache ) ,
                "::" , stringify ! ( index_length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async_cache ) ) . index_size as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async_cache ) ,
                "::" , stringify ! ( index_size ) ));
}
impl Clone for mchar_async_cache {
    fn clone(&self) -> Self { *self }
}
pub type mchar_async_cache_t = mchar_async_cache;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mchar_async {
    pub origin_size: usize,
    pub chunks: *mut *mut mchar_async_chunk_t,
    pub chunks_pos_size: usize,
    pub chunks_pos_length: usize,
    pub chunks_size: usize,
    pub chunks_length: usize,
    pub chunk_cache: mchar_async_cache_t,
    pub nodes: *mut mchar_async_node_t,
    pub nodes_length: usize,
    pub nodes_size: usize,
    pub nodes_cache: *mut usize,
    pub nodes_cache_length: usize,
    pub nodes_cache_size: usize,
    pub mcsync: *mut mcsync_t,
}
#[test]
fn bindgen_test_layout_mchar_async() {
    assert_eq!(::std::mem::size_of::<mchar_async>() , 168usize , concat ! (
               "Size of: " , stringify ! ( mchar_async ) ));
    assert_eq! (::std::mem::align_of::<mchar_async>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( mchar_async ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async ) ) . origin_size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async ) , "::" ,
                stringify ! ( origin_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async ) ) . chunks as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async ) , "::" ,
                stringify ! ( chunks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async ) ) . chunks_pos_size as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( mchar_async ) , "::" ,
                stringify ! ( chunks_pos_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mchar_async ) ) . chunks_pos_length as *
